Coisas naturais (#21)
* Convert legacy dev-shell to flake devShells.default

* add flakes updates

Signed-off-by: M.Hoffmann <hoffmann@poli.ufrj.br>

* fix flake

Signed-off-by: M.Hoffmann <hoffmann@poli.ufrj.br>

* flake.nix updated

Signed-off-by: M.Hoffmann <hoffmann@poli.ufrj.br>

* everything in its right place

Signed-off-by: M.Hoffmann <hoffmann@poli.ufrj.br>

* update readme

Signed-off-by: M.Hoffmann <hoffmann@poli.ufrj.br>

---------

Signed-off-by: M.Hoffmann <hoffmann@poli.ufrj.br>
